Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཚད་མེད་པའི་ཡོན་ཏན་སེམས་ཅན་རྣམས་ལ་ཡོངས་སུ་བརྗོད་པ་དང་། ལ་ལར་ནི་ལྷའི་དབང་པོ་རབ་དགའ་ལྡན་དུ་གྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ཚེ་གཅིག་གིས་ཐོགས་པའི་ཡོན་ཏན་བརྗོད་པ་དང་། ལ་ལར་ནི་ལྷའི་རྒྱལ་པོ་རབ་འཕྲུལ་དགར་གྱུར་ཏེ། ལྷའི་འཁོར་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྤྲུལ་པའི་རྒྱན་ཡོངས་སུ་སྟོན་པ་དང་། ལ་ལར་ནི་ལྷའི་རྒྱལ་པོ་དབང་བསྒྱུར་དུ་གྱུར་ཏེ། ལྷ་རྣམས་ལ་ཆོས་ཐམས་ཅད་ལ་དབང་བསྒྱུར་བ་ཡང་དག་པར་སྟོན་པ་དང་། ལ་ལར་ནི་བདུད་དུ་གྱུར་ཏེ། ལྷ་རྣམས་ལ་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་མི་རྟག་པར་སྟོན་པ་དང་། ལ་ལར་ནི་ལྷ་མ་ཡིན་གྱི་དབང་པོའི་གནས་སུ་སྐྱེས་ཏེ། ལྷ་མ་ཡིན་གྱི་འཁོར་ནང་རྒྱལ་དང་། དྲེགས་པ་དང་། རློམ་པ་ཐམས་ཅད་རབ་ཏུ་སྤང་བ་དང་། ཡེ་ཤེས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོར་འཇུག་པར་བྱ་བ་དང་། ཆོས་ཀྱི་ཡེ་ཤེས་ཀྱི་རྒྱུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་པ་མཐོང་ངོ་། །ཁང་པ་བརྩེགས་པ་ལ་ལར་ནི་གཤིན་རྗེའི་འཇིག་རྟེན་མཐོང་བར་གྱུར་ཏེ།
en: In some, he saw him being a lord of the world, benefiting the world and gathering beings through all kinds of happiness; in some, being a Śakra, turning beings away from delighting in sensory pleasures; in some, being a Brahmā, describing to beings dhyāna and immeasurable joy; in some, being a Suyāma deva lord, describing limitless qualities to beings; in some, being a Saṃtuṣita deva lord, describing the qualities of a bodhisattva with one life remaining; in some, being a Sunirmita deva lord, manifesting the array of emanations of all bodhisattvas to his retinue; in some, being a Vaśavartin deva lord, displaying to the devas power over all phenomena; in some, being a Māra, teaching to devas the impermanence of all good fortune; and in some, being born in the dwelling of the lord of the asuras, teaching the Dharma to his retinue of asuras in order that they forsake all pride, arrogance, and conceit, enter the great ocean of wisdom, and attain the illusory powers of the wisdom of the Dharma.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་འོད་ཀྱིས། སེམས་ཅན་དམྱལ་བ་ཐམས་ཅད་སྣང་བར་བྱེད་ཅིང་། སེམས་ཅན་དམྱལ་བར་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ཀྱི། སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ་མཐོང་ངོ་། །ཁང་པ་བརྩེགས་པ་ལ་ལར་ནི་ཡི་དགས་ཀྱི་གནས་མཐོང་བར་གྱུར་ཏེ།
en: In some kūṭāgāras he saw the realm of Yama, in which the light of the bodhisattva Maitreya illuminated all the beings in the hells, so that all the sufferings of the hells ceased for the beings who had been reborn in the hells.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ། སེམས་ཅན་ཡི་དགས་ཀྱི་གནས་སུ་སྐྱེས་པ་རྣམས་ལ། ཁ་ཟས་དང་། བཏུང་བ་མང་པོ་ཉེ་བར་བསྒྲུབ་ཅིང་བཀྲེས་པ་དང་། སྐོམ་པ་རབ་ཏུ་ཞི་བར་བྱེད་པ་མཐོང་ངོ་། །
en: In some kūṭāgāras he saw the realm of the pretas, in which the bodhisattva Maitreya created much food and drink for the beings who had been reborn in the preta realms, ending their hunger and thirst.

source: ཁང་པ་བརྩེགས་པ་ལ་ལར་ནི་བྱོལ་སོང་གི་སྐྱེ་གནས་ན་སྐྱེ་བའི་སྐྱེ་མཆེད་རྣམ་པ་ཐ་དད་པ་སྣ་ཚོགས་ཀྱིས་བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གཏོགས་པའི། སེམས་ཅན་མང་པོ་འདུལ་བར་མཐོང་ངོ་། །ཁང་པ་བརྩེགས་པ་ལ་ལར་ནི་རྒྱལ་པོ་ཆེན་པོའི་ཁམས་སུ་གཏོགས་པའི།
en: In some kūṭāgāras he saw the worlds of animals, in which through taking birth in their various kinds of physical existences he guided those beings who had been reborn as animals.

source: ལྷའི་འཁོར་ན་འཇིག་རྟེན་གྱི་མགོན་པོ་རྣམས་ལ་ཆོས་སྟོན་པ་མཐོང་ངོ་། །ལ་ལར་ནི་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱི་འཁོར་ན། ལ་ལར་ནི་ལྷའི་རྒྱལ་པོ། །རབ་མཚེ་མའི་འཁོར་ན། ལ་ལར་ནི་ལྷའི་རྒྱལ་པོ་རབ་དགའ་ལྡན་གྱི་འཁོར་ན། ལ་ལར་ནི་ལྷའི་རྒྱལ་པོ་རབ་འཕྲུལ་དགའི་འཁོར་ན། ལ་ལར་ནི་ལྷའི་རྒྱལ་པོ་དབང་བསྒྱུར་གྱི་འཁོར་ན། ལ་ལར་ནི་བདུད་ཀྱི་འཁོར་ན། ཁང་པ་བརྩེགས་པ་ལ་ལར་ནི། ཚངས་པའི་དབང་པོའི་འཁོར་ན། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཆོས་སྟོན་པ་མཐོང་ངོ་། །
en: In some kūṭāgāras he saw him in the deva retinues of the realms of the Mahārājas, where he taught the Dharma to the world lords; in some, he was in the retinue of a Śakra deva lord; in some, in the retinue of a Suyāma deva king; in some, in the retinue of a Saṃtuṣita deva king; in some, in the retinue of a Sunirmita deva king; in some, in the retinue of a Vaśavartin deva king; in some, in the retinue of a Māra; and in some kūṭāgāras he saw the bodhisattva Maitreya teaching the Dharma in the retinue of a Brahmā lord.

source: ལ་ལར་ནི་ཀླུ་དང་ལྟོ་འཕྱེ་ཆེན་པོའི་འཁོར་ན། ལ་ལར་ནི་གནོད་སྦྱིན་དང་སྲིན་པོའི་འཁོར་ན། ལ་ལར་ནི་དྲི་ཟ་དང་མིའམ་ཅིའི་འཁོར་ན། ལ་ལར་ནི་ལྷ་མ་ཡིན་དང་གསོད་འཕྲོག་གི་དབང་པོའི་འཁོར་ན། ལ་ལར་ནི་ནམ་མཁའ་ལྡིང་གི་དབང་པོ་ཆེན་པོའི་འཁོར་ན། ལ་ལར་ནི་མིའི་འཁོར་ན། ཁང་པ་བརྩེགས་པ་ལ་ལར་ནི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པའི་འཁོར་ན། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཆོས་སྟོན་པ་མཐོང་ངོ་། །ལ་ལར་ནི་ཉན་ཐོས་ཀྱི་འཁོར་ན། ལ་ལར་ནི་རང་སངས་རྒྱས་ཀྱི་འཁོར་ན། ལ་ལར་ནི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ན། ཁང་པ་བརྩེགས་པ་ལ་ལར་ནི།
en: In some kūṭāgāras, he saw the bodhisattva Maitreya teaching the Dharma in the retinues of great nāgas and mahoragas; in some, in the retinues of yakṣas and rākṣasas; in some, in the retinues of gandharvas and kinnaras; in some, in the retinues of the lords of the asuras and dānavas; in some, in the retinues of great lords of the garuḍas; in some, in the retinues of humans; in some, in the retinues of devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans; in some, in the retinues of śrāvakas; in some, in the retinues of pratyeka­buddhas; and in some, in the retinues of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཐོག་མ་བསྐྱེད་པ་ལས་དང་པོ་བ་རྣམས་ལ། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཆོས་སྟོན་པ་མཐོང་ངོ་། །ལ་ལར་ནི་སྤྱོད་པ་ལ་ཞུགས་པ་རྣམས་ལ། ལ་ལར་ནི་བཟོད་པ་ཐོབ་ཅིང་ཕྱིར་མི་ལྡོག་པ་རྣམས་ལ། ལ་ལར་ནི་ཚེ་གཅིག་གིས་ཐོགས་ཤིང་དབང་བསྐུར་བ་རྣམས་ལ། ཁང་པ་བརྩེགས་པ་ལ་ལར་ནི། བྱང་ཆུབ་སེམས་དཔའ་ས་དང་པོ་ལ་གནས་པ་རྣམས་ལ་སའི་ཁྱད་པར་ཡོངས་སུ་བརྗོད་པ་མཐོང་ངོ་། །ལ་ལར་ནི་ས་བཅུ་ལ་གནས་པའི་བར་གྱི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་ལྷན་ཅིག་ཏུ།
en: In some kūṭāgāras, he saw the bodhisattva Maitreya teaching the Dharma to beginner bodhisattvas who had developed the aspiration to enlightenment for the first time; in some, to those who were engaged in bodhisattva conduct; in some, to those who had attained patience and were irreversible; and in some, to those who were in their last lifetime and had been consecrated by the buddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་ཐམས་ཅད་ཀྱི་ཁྱད་པར་ཡང་དག་པར་བགྲོ་བར་བསྐྱོད་པ་མཐོང་ངོ་། །ལ་ལར་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། ལ་ལར་ནི་བསླབ་པ་ཐམས་ཅད་ལ་མངོན་དུ་འཇུག་པར་བྱ་བ་ཀུན་ཏུ་མཐའ་ཡས་པ་དང་། ལ་ལར་ནི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་ལ་འཇུག་པ་རྒྱ་ཆེན་པོ་དང་། ལ་ལར་ནི་རྣམ་པར་ཐར་པའི་ཚུལ་ཟབ་མོ་དང་། ལ་ལར་ནི་བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་། མངོན་པར་ཤེས་པ་ཞི་བའི་ཡུལ་གྱིས་རྒྱས་པར་དགང་བ་དང་། ལ་ལར་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། འདུལ་བ་དང་། ཐབས་ཀྱི་སྒོ་ལ་འཇུག་པ་དང་། ལ་ལར་ནི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་རྒྱ་ཆེ་བ་དང་། ཁང་པ་བརྩེགས་པ་ལ་ལར་ནི། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་སྐལ་བ་མཐུན་པར་སྤྱོད་པའི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་འགྲོགས་ཤིང་།
en: In some kūṭāgāras, he saw him describing the particular qualities of a bhūmi to bodhisattvas who were on the first bhūmi, and in some he saw the bodhisattva Maitreya discussing all the particular qualities of the bhūmis with bodhisattvas on all ten bhūmis; in some, he had the completion of all the perfections; in some, he had infinite entries into all trainings; in some, he had vast entries through the gateways of all samādhis; in some, he had profound liberations; in some he had pervaded the peaceful scope of dhyāna, samādhi, samāpatti, and higher cognitions; in some, he entered the bodhisattva’s conduct, guidance, and methods; and in some he had a vast accomplishment of prayers.

source: འཇིག་རྟེན་ལ་ཕན་པར་བྱ་བའི་དོན་དུ། བཟོའི་གནས་སྣ་ཚོགས་དང་། གཙུག་ལག་གི་ཁྱད་པར་སེམས་ཅན་ཐམས་ཅད་ལ། ཕན་པ་དང་བདེ་བར་འགྱུར་བ་དང་། འབྱོར་བ་རྣམས་ཡང་དག་པར་འགྲོ་བ་མཐོང་ངོ་། །
en: In some kūṭāgāras, he saw the bodhisattva Maitreya accompanying bodhisattvas who followed the same kind of conduct and spoke in unison about engaging, in order to benefit beings, in the various specific kinds of arts and treatises that bring benefit, happiness, and wealth to all beings.

source: ལ་ལར་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཚེ་གཅིག་གིས། ཐོགས་པ་རྣམས་དང་འགྲོགས་ཤིང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་ལ་དབང་བསྐུར་བའི་སྒོ་ཡང་དག་པར་འགྲོ་བ་མཐོང་ངོ་། །ཁང་པ་བརྩེགས་པ་ལ་ལར་ནི།
en: In some, he saw him speaking in unison with bodhisattvas with one lifetime remaining about entering the gateway of the wisdom consecration of all the buddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཆགས་པ་མྱེད་ཅིང་། ལོ་བརྒྱ་སྟོང་དུ་མར་མི་གཏོང་བ་ལ་བརྩོན་པ་མཐོང་ངོ་། །ལ་ལར་ནི་ལུང་དཔོག་པ་དང་། ཁ་ཏོན་བྱ་བ་ལ་བརྩོན་པར།
en: In some kūṭāgāras, he saw the bodhisattva Maitreya dedicated to walking for many hundreds of thousands of years.

source: ལ་ལར་ནི་ཆོས་ཀྱི་སྒོ་རབ་ཏུ་བརྟགས་པ་ལ་བརྩོན་པར། ལ་ལར་ནི་དམ་པའི་ཆོས་བགྲོ་བ་ལ་བརྩོན་པར། ལ་ལར་ནི་དམ་པའི་ཆོས་བྲི་བ་ལ་བརྩོན་པར། ལ་ལར་ནི་བྱམས་པ་ལ་མཉམ་པར་གཞག་པར། ལ་ལར་ནི་བསམ་གཏན་དང་། ཚད་མེད་པ་ཐམས་ཅད་ལ་མཉམ་པར་གཞག་པར། ལ་ལར་ནི་རྒྱས་པའི་སྐྱེ་མཆེད་དང་། རྣམ་པར་ཐར་པ་ཐམས་ཅད་ལ་མཉམ་པར་གཞག་པར། ཁང་པ་བརྩེགས་པ་ལ་ལར་ནི་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ། བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་བསྒྲུབ་པའི་ཐབས་ཀྱི་ཏིང་ངེ་འཛིན་ལ། མཉམ་པར་གཞག་པར་མཐོང་ངོ་། །ཁང་པ་བརྩེགས་པ་ལ་ལར་ནི་བྱང་ཆུབ་སེམས་དཔའི།
en: In some kūṭāgāras, he saw the bodhisattva Maitreya dedicated to chanting the teachings; in some, he was dedicated to examining the gateways of the Dharma; in some, he was dedicated to discussing the Dharma; in some, he was dedicated to writing out the Dharma; in some, he was resting in meditation on love; in some, he was resting in meditation on all dhyānas and immeasurables; in some, he was resting in meditation on all the āyatana meditation states and liberations; and in some, he was resting in meditation in the samādhi of the method for accomplishing the higher cognitions of a bodhisattva.

source: ཏིང་ངེ་འཛིན་སྤྲུལ་པ་ཡོད་པ་ལ་མཉམ་པར་བཞག་པའི་བྱང་ཆུབ་སེམས་དཔའ་མང་པོ་མཐོང་སྟེ། དེ་དག་གི་ལུས་ཐམས་ཅད་དང་། བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་སྤྲུལ་པ་ཐམས་ཅད་ཀྱི་སྤྲིན་མང་པོ་འབྱུང་བ་མཐོང་ངོ་། །ལ་ལའི་ལུས་དང་། བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ནི།
en: In some kūṭāgāras, he saw many bodhisattvas resting in the bodhisattva samādhi of emanations, and he saw many clouds of all emanations coming from all the pores of all their bodies.

source: ལྷའི་རིས་ཀྱི་སྤྲིན་མང་པོ་འབྱུང་བ་མཐོང་ངོ་། །ལ་ལའི་ལུས་དང་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ནི་ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་གྱི་མགོན་པོ་དང་།
en: From some of them, he saw many clouds of devas arising from all their bodies and pores.

source: འཁོར་ལོས་སྒྱུར་བའི་སྤྲིན་མང་པོ་འབྱུང་བ་དང་། ལ་ལའི་ལུས་དང་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ནི། ཁམས་ཀྱི་རྒྱལ་པོའི་སྤྲིན་མང་པོ་འབྱུང་བ་དང་། ལ་ལའི་ལུས་དང་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ནི། རྒྱལ་བུ་གཞོན་ནུའི་སྤྲིན་མང་པོ་འབྱུང་བ་དང་། ལ་ལའི་ལུས་དང་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ནི། ཚོང་དཔོན་དང་། བློན་པོ་དང་། ཁྱིམ་བདག་གི་སྤྲིན་མང་པོ་དང་། ལ་ལའི་ལུས་དང་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ནི། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྲིན་མང་པོ་དང་། ལ་ལའི་ལུས་དང་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ནི། དེ་བཞིན་གཤེགས་པའི་སྐུའི་སྤྲིན་མང་པོ་དང་། ལ་ལའི་ལུས་དང་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ནི། སེམས་ཅན་ཐམས་ཅད་དུ་སྤྲུལ་པའི། སྤྲིན་ཚད་མེད་པ་འབྱུང་བ་མཐོང་ངོ་། །ལ་ལའི་ལུས་དང་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ནི།
en: From some of them, he saw many clouds of nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, Śakras, Brahmās, world lords, and cakravartins arising from all their bodies and pores; from some of them, many clouds of kings of realms from all their bodies and pores; from some of them, many clouds of young princes from all their bodies and pores; from some of them, many clouds of head merchants, ministers, and householders from all their bodies and pores; from some of them, many clouds of śrāvakas, pratyeka­buddhas, and bodhisattvas from all their bodies and pores; from some of them, many clouds of the bodies of tathāgatas from all their bodies and pores; and from some of them, measureless clouds of emanated beings arising from all their bodies and pores.

source: ཆོས་ཀྱི་སྒོ་རྣམ་པ་སྣ་ཚོགས་འབྱུང་བ་ཐོས་པར་གྱུར་ཏེ། འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་བསྔགས་པའི་སྒོ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་དང་། ཐབས་དང་། སྨོན་ལམ་དང་། སྟོབས་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་དང་། བསྡུ་བའི་དངོས་པོ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་། མངོན་པར་ཤེས་པ་དང་། རིག་པ་དང་། གཟུངས་དང་། སྤོབས་པ་དང་། བདེན་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ཞི་གནས་དང་། ལྷག་མཐོང་དང་། རྣམ་པར་ཐར་པའི་སྒོ་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་། རྟེན་པ་དང་། ཆོས་ཀྱི་མདོ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པའི་གཏམ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་གཏམ་དང་། ཐེག་པ་ཆེན་པོའི་གཏམ་དང་། ས་དང་བཟོད་པ་དང་། སྤྱོད་པ་དང་། སྨོན་ལམ་གྱི་སྒོ་དང་། དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱི་སྒོར་འཇུག་པའི་སྒྲ་མང་པོ་འབྱུང་བ་ཐོས་སོ། །
en: From some of them, he heard various Dharma gateways coming from all their bodies and pores, which means he heard the many sounds of entering all Dharma doors such as the door of praising the qualities of bodhisattvas; the door of the perfection of generosity; the doors of the perfections of conduct, patience, diligence, dhyāna, wisdom, method, prayer, strength, and knowledge; the doors of the methods of gathering pupils, the dhyānas, the immeasurables, the samādhis, the samāpattis, the higher cognitions, gnosis, the retentions, the eloquences, the truths, the discernments, śamatha, vipaśyanā, and liberation; and the doors of dependent origination, elimination, the bases of miraculous powers, the powers, the strengths, the aspects of enlightenment, the paths, the teaching of the Śrāvakayāna, the teaching of the Pratyeka­buddhayāna, the teaching of the Mahāyāna, the bhūmis, patience, conduct, and prayer.

source: ཁང་པ་བརྩེགས་པ་ལ་ལར་ནི། དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་ཀུན་ནས་འདུས་པར་མཐོང་སྟེ།
en: In some kūṭāgāras, he saw the gathered assemblies of followers of tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་རྣམ་པ་ཐ་དད་པ་སྣ་ཚོགས་སྐྱེ་བ་དང་། རིགས་རྣམ་པ་ཐ་དད་པ་དང་། སྐུ་རྣམ་པར་ཕྱེ་བ་ཚད་མེད་པ་རྣམ་པ་ཐ་དད་པ་དང་། སྐུ་ཚེ་རྣམ་པ་ཐ་དད་པ་དང་། ཞིང་རྣམ་པ་ཐ་དད་པ་དང་། བསྐལ་པ་རྣམ་པ་ཐ་དད་པ་དང་། ཆོས་བསྟན་པ་རྣམ་པ་ཐ་དད་པ་དང་། འབྱུང་བའི་སྒོ་རྣམ་པ་ཐ་དད་པ་དང་། དམ་པའི་ཆོས་གནས་པ་རྣམ་པ་ཐ་དད་པ་ནས། འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ།
en: He saw the various different births of those tathāgatas, their different families, their countless different lifetimes, their different realms, their different kalpas, their different teachings of the Dharma, their different gateways of emanations, the different durations of their Dharmas, and so on, up to all the different forms of their assemblies of followers without exception.

source: རྣམ་པ་ཐ་དད་པ་དག་ཀྱང་མ་ལུས་པར་མཐོང་བར་གྱུར་ཏོ། །ཁང་པ་བརྩེགས་པ་ཆེན་པོ་རྣམ་པར་སྣང་མཛད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པའི་སྙིང་པོ། དེའི་དབུས་སུ་ཁང་པ་བརྩེགས་པ་གཅིག་ཅིག་གཞན་པས་ཆེ་ལ་ཡངས་ཤིང་། ཁང་པ་བརྩེགས་པ་གཞན་ཐམས་ཅད་ཀྱི་རྒྱན་མ་ལུས་པ་ཐམས་ཅད་པས་ཀྱང་ཆེས་ལྷག་པར་འཕགས་པའི་རྒྱན་གྱིས། ཡང་དག་པར་བརྒྱན་པ་ཞིག་འདུག་པར་མཐོང་སྟེ།
en: He saw in the center of the Vairocana­vyūhālaṃkāra­garbha kūṭāgāra one kūṭāgāra that was greater and vaster than the others and was adorned with adornments that were greatly superior to all the adornments, without exception, of all the other kūṭāgāras.

source: ཁང་པ་བརྩེགས་པ་དེའི་ནང་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདུག་པ་མཐོང་ངོ་། །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ནས་ཡང་།
en: He saw within that kūṭāgāra a billion-world world realm.

source: གླིང་བཞི་པ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། འཛམ་བུའི་གླིང་བྱེ་བ་ཕྲག་བརྒྱ་དང་། དགའ་ལྡན་གྱི་གནས་བྱེ་བ་ཕྲག་བརྒྱ་འཁོད་པར་མཐོང་ངོ་། །འཛམ་བུའི་གླིང་དེ་དག་ཐམས་ཅད་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་པད་མོའི་ནང་དུ་སྐྱེ་བ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པས་ཡོངས་སུ་བླངས་པ་དང་། གོམ་པ་བདུན་དུ་འགྲོ་བ་དང་། ཕྱོགས་བཅུར་རྣམ་པར་བལྟས་པ་དང་། སེང་གེའི་ང་རོ་ཆེན་པོ་སྒྲོག་པ་དང་། གཞོན་ནུའི་ས་ཐམས་ཅད་ཡོངས་སུ་སྟོན་པ་དང་། བཙུན་མོའི་འཁོར་གྱི་ནང་ན་གནས་པ་དང་། བཟའ་ཤིང་གི་ར་བར་འགྲོ་བ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མངོན་དུ་ཕྱོགས་ཏེ། མངོན་པར་བྱུང་ནས་རབ་ཏུ་འབྱུང་བ་དང་། དཀའ་བའི་སྤྱོད་པ་ཡོངས་སུ་སྟོན་པ་དང་། ཟས་ཟ་བ་དང་། སྙིང་པོ་བྱང་ཆུབ་ཏུ་འགྲོ་བ་དང་། བདུད་རྒོལ་དུ་འཇུག་པ་དང་། བྱང་ཆུབ་ཏུ་རྣམ་པར་འཚང་རྒྱ་བ་དང་། བྱང་ཆུབ་ཀྱི་ཤིང་ལ་མྱིག་མི་འགེབས་པར་ལྟ་བ་དང་། ཚངས་པ་ཆེན་པོས་གསོལ་བ་གདབ་པ་དང་། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཡུལ་སྣ་ཚོགས་ཡོངས་སུ་བསྟན་པ་དང་། རྣམ་པ་ཐ་དད་པ་དང་། ཚུལ་དང་མྱིང་རྣམ་པ་སྣ་ཚོགས་བསྟན་པ་རྣམ་པ་ཐ་དད་པ་དང་། ཚེའི་ཚད་སྣ་ཚོགས་རྣམ་པ་ཐ་དད་པ་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་རྒྱན་སྣ་ཚོགས་ཐ་དད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དག་པའི་ཚུལ་བསྟན་པས་སྣ་ཚོགས་རྣམ་པ་ཐ་དད་པ་དང་།
en: He saw in that billion-world world realm the billion four-continent worlds and a billion Jambudvīpas and a billion Tuṣita paradises.

source: སྤྱོད་པ་དང་སྨོན་ལམ་བརྗོད་པ་སྣ་ཚོགས་རྣམ་པ་ཐ་དད་པ་དང་། ཆོས་བསྟན་ཅིང་རྣམ་པར་དགོད་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཐབས་སྣ་ཚོགས་རྣམ་པ་ཐ་དད་པ་དང་། རིང་བསྲེལ་བགོ་བ་དང་། བསྟན་པ་གནས་པའི་བྱིན་གྱི་རླབས་ཡོངས་སུ་བསྟན་པ་སྣ་ཚོགས་རྣམ་པ་ཐ་དད་པས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཞིང་ལྷའི་གནས་སུ་འགྲོ་བ་མཐོང་སྟེ།
en: He saw within those Jambudvīpas the bodhisattva Maitreya being born from within a lotus; being taken up by Śakra and Brahmā, walking seven steps, gazing into the ten directions, and emitting the lion’s roar; manifesting all the stages of youth; being within the harem; going to the park; turning toward omniscience; setting forth and entering homelessness; manifesting the practice of asceticism; eating food; going to the bodhimaṇḍa; engaging in subjugating the māras; attaining the enlightenment of buddhahood; gazing without closing the eyes at the Bodhi tree; being supplicated by Mahābrahmā; turning the wheel of the Dharma; and passing away to divine abodes, which was done through various different manifestations of the range of attainments of buddhahood, followed by turning the wheel of the Dharma in different ways, names, and forms, with various different lifespans, with various different assemblies of followers, with various different manifestations of pure buddha realms, with various different conduct and prayers, with various methods for presenting and teaching the Dharma and for ripening beings, and with various different manifestations of the distribution of relics and the power of the duration of the teachings.

source: དེ་དག་ཐམས་ཅད་ནའང་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཉིད་རྐང་པའི་དྲུང་ན་འདུག་པར་རང་རང་གིས་ཤེས་པར་གྱུར་ཏོ། །དེའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་།
en: Sudhana, the head merchant’s son, perceived himself to be at the feet of them all.

source: བྱ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྟན་པ་དང་། ཚེའི་ཚད་རྣམ་པ་ཐ་དད་པ་ཐམས་ཅད་ལ་དྲན་པ་མ་ཉམས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་འདུ་ཤེས་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པའི་ཡེ་ཤེས་ཀྱི་ས་ལ་གནས་པས། ཁང་པ་བརྩེགས་པ་དེ་དག་གི་དྲིལ་དང་།
en: Through the blessing of the unfailing memory, all the steadfast knowledge of all those assemblies of followers, all those manifestations of activities, and all those different lifespans remained within his level of comprehending knowledge.

source: དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་དང་། རོལ་མོ་དང་། གླུ་ལ་སྩོགས་པའི་དམྱིགས་པ་ཅི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ལས། ཆོས་ཀྱི་སྤྲིན་གྱི་འབྲུག་སྒྲ་བསམ་གྱིས་མི་ཁྱབ་པ་འབྱུང་བ་ཐོས་པར་གྱུར་ཏེ། ལ་ལ་ལས་ནི་བྱང་ཆུབ་ཀྱི་སེམས་རྣམ་པ་ཐ་དད་པ་དང་། ལ་ལ་ལས་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་དང་། སྨོན་ལམ་རྣམ་པ་ཐ་དད་པ་དང་། ལ་ལ་ལས་ནི་ས་ཚད་མེད་པ་རྣམ་པ་ཐ་དད་པ་དང་།
en: From all the nets of strings of bells and jingle bells, and from the music and songs and all other perceived sounds, he heard the inconceivable thunder from the clouds of the Dharma being emitted.

source: ལ་ལ་ལས་ནི་མངོན་པར་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པས་རྣམ་པར་འཕྲུལ་བ་རྣམ་པ་ཐ་དད་པ་དང་། ལ་ལ་ལས་ནི་དེ་བཞིན་གཤེགས་པའི་མཆོད་པ་སྣ་ཚོགས་རྣམ་པ་ཐ་དད་པ་དང་། ལ་ལ་ལས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྒྱན་རྣམ་པ་ཐ་དད་པ་དང་། ལ་ལ་ལས་ནི་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་སྤྲིན་ཚད་མེད་པ་རྣམ་པ་ཐ་དད་པ་དང་། དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱི་སྒྲ་གོང་དུ་ཇི་སྐད་དུ་བརྗོད་པ་ཐམས་ཅད་ཐོས་པར་གྱུར་ཏོ། །ལ་ལ་ལས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འཇུག་པའི་སྒྲ་ཐོས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་ཆེ་གེ་མོ་ཞིག་ཅེས་བྱ་བར་བྱང་ཆུབ་སེམས་དཔའི་མྱིང་དང་། ཆེ་གེ་མོ་ཞིག་གི་ཆོས་ཀྱི་སྒོ་ནི་ཆེ་གེ་མོ་ཞིག་ཅེས་བྱ་བ་ཐོས། དགེ་བའི་བཤེས་གཉེན་ནི། ཆེ་གེ་མོ་ཞིག་གིས་ཡང་དག་པར་བསྐུལ། དེ་བཞིན་གཤེགས་པ་ནི་ཆེ་གེ་མོ་ཞིག་གི་ཞབས་ཀྱི་དྲུང་དུ་བསྐལ་པའི་མིང་ནི་འདི་ཞེས་བྱ་བར། སངས་རྒྱས་ཀྱི་ཞིང་ནི་འདི་ལྟ་བུ་ཞིག་ཏུ་འཁོར་གྱི་དཀྱིལ་འཁོར་ནི་འདི་ལྟ་བུ་ཞིག་ན་འདུག་འདུག་སྟེ། དགེ་བའི་རྩ་བ་ནི་འདི་ལྟ་བུ་ཞིག་བསྐྱེད་ནས། དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་ནི། འདི་ལྟ་བུ་དག་གཅིག་ཐོས་ཏེ། ལྷག་པའི་བསམ་པ་ནི་འདི་ལྟ་བུ་དང་། སྨོན་ལམ་གྱི་རྣམ་པ་ནི་འདི་འདྲ་བ་ཞིག་གིས། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། དེས་བསྐལ་པ་ནི་འདི་སྙེད་ཅིག་ཏུ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་དེ། བསྐལ་པ་འདི་སྙེད་ཅིག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །མཚན་ནི་འདི་ཞེས་བྱ། སྐུ་ཆེའི་ཚད་ནི་འདི་ཙམ་ཞིག་སྟེ། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་དང་། རྒྱན་ཕུན་སུམ་ཚོགས་པ་འདི་འདྲ་བ་དང་། སྨོན་ལམ་གྱི་ཁྱད་པར་འདི་ལྟ་བུ་ཞིག་དང་། སེམས་ཅན་རྣམ་པར་གདུལ་བ་འདི་འདྲ་བ་ཞིག་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་འཁོར་ཀུན་ནས་འདུས་པ་འདི་འདྲ་བ་ཞིག་གོ །དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་། བསྐལ་བ་འདི་སྙེད་ཅིག་ཏུ་དམ་པའི་ཆོས་གནས་པར་འགྱུར་རོ། །སེམས་ཅན་གྱི་དོན་ནི་འདི་ཙམ་ཞིག་ཏུ་འགྱུར་རོ། །
en: He heard from them all the sounds of all the Dharma just as it had been previously taught: from some he heard the different kinds of aspiration to enlightenment; from some, the different kinds of conduct and prayer of the perfections; from some, the different kinds of countless bhūmis; from some, the different kinds of miraculous manifestation from inconceivable higher cognitions; from some, the different kinds of various offerings to the tathāgatas; from some, the different kinds of displays of buddha realms; and from some, the different kinds of measureless clouds of the Dharma of the tathāgatas.

source: ཞེས་བྱ་བའི་སྒྲ་ཐོས་སོ། །ལ་ལ་ལས་ནི་འཇིག་རྟེན་གྱི་ཁམས་ཆེ་གེ་མོ་ཞིག་ན། བྱང་ཆུབ་སེམས་དཔའི་མིང་དང་། ཆེ་གེ་མོ་ཞིག་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ན། གཏང་བར་དཀའ་བ་འདི་ལྟ་བུའི་ཡོངས་སུ་གཏོང་བ་བརྒྱ་ནི་བྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་ཆེ་གེ་མོ་ཞིག་ནི། ཚུལ་ཁྲིམས་སྲུང་ངོ་། །བཟོད་པ་སྒོམ་མོ། །བརྩོན་འགྲུས་རྩོམ་མོ། །བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་གོ །ཤེས་རབ་ཀྱིས་རྣམ་པར་དབྱེ་བ་ལ་བརྩོན་ནོ། །བྱང་ཆུབ་སེམས་དཔའ་ཆེ་གེ་མོ་ཞིག་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་བཙལ་བའི་དོན་དུ་རྒྱལ་པོའི་སྲིད་ཡོངས་སུ་གཏོང་བར་བྱེད་དོ། །རིན་པོ་ཆེ་ཡོངས་སུ་གཏོང་བ་དང་། བུ་ཡོངས་སུ་གཏོང་བ་དང་། ཆུང་མ་ཡོངས་སུ་གཏོང་བ་དང་། རྐ་ལག་དང་མྱིག་དང་། མགོ་ཡོངས་སུ་གཏོང་བ་བྱེད་དོ། །མྱེར་མཆོང་བ་བྱེད་དོ། །
en: From some, he heard the words concerning entering into omniscience: that in a world realm of such and such a name, a bodhisattva with such and such a name hears such and such a Dharma gateway, is inspired by such and such a kalyāṇamitra, and at the feet of such and such a tathāgata hears that in a kalpa with a certain name he will be present in a certain realm, in a certain circle of followers, and having generated certain roots of merit and having heard of certain buddha qualities will develop a certain aspiration, and through a certain kind of prayer will develop the aspiration to enlightenment and will practice bodhisattva conduct for a certain number of kalpas, and will then attain the highest, complete enlightenment of buddhahood, when he will have a certain name and a certain lifespan and have a certain perfection of qualities and arrays of a buddha realm, and through certain specific prayers will guide beings in a certain way and will gather a certain following of śrāvakas and pratyeka­buddhas, and when he has passed into nirvāṇa his Dharma will remain for a certain number of kalpas, and he will thus benefit beings in that way.
